# Install Shell
brew 'zsh'

# Setup device sync via DropBox
brew 'mackup'

# Utilities Install
brew 'mas'
brew 'ncdu'

# Install more recent versions of some macOS tools
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'git-flow'
brew 'grep'
brew 'vim'

# Development
## Python
brew 'python'
brew 'python@2'
## Node
brew 'node'
brew 'webpack'
## PHP
brew 'php'
brew 'composer'
## Database
brew 'redis'
## Orchestration
brew 'ansible'

# Install Mac App Store apps
mas 'Telegram', id: 747648890 ## Secure text messaging

# Cask installation
## Solves the cask issue with overwriting on update from in-app usage
cask_args appdir: '/Applications'
# Fonts
cask 'font-fira-code'
# Apps
cask 'amazon-drive'		    ## Use S3 like DropBox
cask 'appcleaner'		    ## Get rid of stuff well
cask 'caffeine'			    ## Keep the mac awake...
cask 'dropbox'			    ## Used to sync settings across devices
cask 'gitter'			    ## Team communication lobby for GitHub projects
cask 'google-chrome'		## Browser V8 goodness
cask 'insomnia'			    ## RESTful API Testing
cask 'iterm2'			    ## Terminal replacement
cask 'keepassx'			    ## Password manager
cask 'keka'			        ## Open source "open anything" archive extractor tool
cask 'medis'			    ## GUI management for Redis
cask 'namechanger'		    ## File name manager utility
cask 'sequel-pro'		    ## GUI for MySQL database fun
cask 'skype'			    ## Skype for normal people
cask 'slack'			    ## Slack team discussion forum
cask 'spectacle'		    ## App and window management
cask 'sublime-text'		    ## Lightweight text editor
cask 'viscosity'		    ## VPN client software
cask 'visual-studio-code'   ## VS Code Editor'
cask 'vlc'			        ## Media player without the overhead
