# Install Shell
brew 'zsh'

# Setup device sync via DropBox
brew 'mackup'

# Utilities Install 
brew 'mas'
brew 'wget'
brew 'ncdu'
brew 'sshrc' 

# Install more recent versions of some macOS tools
brew 'bash'
brew 'coreutils'
brew 'git' 
brew 'git-flow'
brew 'homebrew/dupes/grep'
brew 'vim'

# Development
## Python
brew 'python' 
brew 'python3'
## Node 
brew 'node', args: ['without-npm']
brew 'yarn'
## COBOL
brew 'gnu-cobol'
## PHP
brew 'php71'
brew 'php71-mcrypt'
brew 'composer'
brew 'drupalconsole'
brew 'drush'
## Database
brew 'mariadb'
brew 'redis' 

# Install Mac App Store apps
mas 'Telegram', id: 747648890 ## Secure text messaging
mas 'Boxy SVG', id: 611658502 ## Mac native SVG image editor
mas 'microsoft-remote-desktop', id: 715768417 ## Remote desktop connection client to RDP
# mas 'onedrive', id: 823766827 ## Local filesystem link to Microsoft OneDrive ## Commented out due to pre-release version's capability to integrate with SharePoint groups and libraries

# Cask installation
## Solves the cask issue with overwriting on update from in-app usage
cask_args appdir: '/Applications'
# Fonts
cask 'font-fira-code'
# Apps
cask 'alfred'			## Spotlight on Steroids
cask 'amazon-drive'		## Use S3 like DropBox
cask 'appcleaner'		## Get rid of stuff well
cask 'caffeine'			## Keep the mac awake...
cask 'cyberduck'		## GUI remote file browser
cask 'dropbox'			## Used to sync settings across devices
cask 'gitter'			## Team communication lobby for GitHub projects
cask 'google-chrome'		## Browser V8 goodness
cask 'insomnia'			## RESTful API Testing
cask 'iterm2'			## Terminal replacement
cask 'keepassx'			## Password manager
cask 'keka'			## Open source "open anything" archive extractor tool
cask 'libreoffice'		## Open source office replacement, much better at dealing with file formats than MS
cask 'namechanger'		## File name manager utility
cask 'obs'			## Open Broadcaster screen capture/video-casting software
cask 'phpstorm'			## JetBrains for php
cask 'poedit'			## i18n translation file editor
cask 'pycharm'			## JetBrains for python & python3
cask 'sequel-pro'		## GUI for MySQL database fun
cask 'slack'			## Slack team discussion forum
cask 'spectacle'		## App and window management
cask 'sublime-text'		## Lightweight text editor
cask 'viscosity'		## VPN client software
cask 'vlc'			## Media player without the overhead
